#include<stdio.h>
int main(void){
    const int kf = 1024;
    int x, starsh, mlad;
    while(scanf("%d", &x) == 1 && x >= 0){// scanf() возвращает коллицесво коректно считаных элементов,в нашем случае это 1. Если ввод закончится, то вернется константа EOF = -1
        starsh = x/kf;
        mlad = x%kf;
        printf("Величина: данные, Базовая:%d байт, Старшая:%d КБ, Младшая:%d байт, Коэффицент: %d\n", x, starsh, mlad, kf);
    }
    return 0;
}
//дробная часть отбрасывается, так как в int нет битов, предназначенных для хранения дробной части
//17 вариант