#include <stdio.h>
#include <math.h>
int main(void){
    int ch = 1;
    for(double a = 0.1; a<=3.0; a += 0.5){
        double va = sin(a) / a;
        printf("№%d X:%.4f Y:%.4f\n", ch, a, va);
        ch++;
    }
    return 0;
}
//gcc num1.c -o num1 -lm -при компиляции указывать -lm, чтобы подключилась библиотека limb и не было ошибок
//не все десятичные числа можно представить в двоичной системе счсления(получается бесконечное число), поэтому происходит округление,которое нарушает точность
//с каждым сложением или вычитание неточность накапливается и цикл может сделать лишнюю итерацию или наоборот сделать их меньше,чем должно быть